cask_args appdir: '/Applications'

tap 'argon/mas'

# terminal basics
cask 'font-meslo-lg-nerd-font'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
brew 'starship'
brew 'lsd'

brew 'curl'
brew 'defaultbrowser'
brew 'fzf'
brew 'git'
brew 'gnupg'
brew 'jq'
brew 'krew'
brew 'kubernetes-cli'
brew 'kustomize'
brew 'mtr'
brew 'p7zip'
brew 'pinentry-mac'
brew 'pv'
brew 'rbenv'
brew 'ripgrep'
brew 'ruby-build'
brew 'sqlite'
brew 'tmux'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'xz'
brew 'yq'
brew 'diffutils'
brew 'coreutils'

cask '1password'
cask '1password-cli'
cask 'alacritty'
cask 'alfred'
cask 'apache-directory-studio'
cask 'aerial'
cask 'caffeine'
cask 'dash@6' # 'dash'
#cask 'docker'
cask 'podman-desktop'
cask 'dropbox'
cask 'firefox'
cask 'iterm2'
cask 'karabiner-elements'
cask 'notion'
cask 'omnidisksweeper'
cask 'omnigraffle'
cask 'rectangle-pro'
cask 'slack'
cask 'sublime-text'
cask 'tailscale-app'
cask 'the-unarchiver'
#cask 'vagrant'
#cask 'virtualbox'
#cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'wireshark-app'
cask 'ha-menu'
cask 'hiddenbar'
cask 'audio-hijack'
cask 'loopback'
# cask 'waves-central' # for clarity vx
# cask 'elgato-stream-deck'

# mas 'Blink Pro', id: 404360415
# mas 'Magnet', id: 441258766
mas 'Parcel', id: 375589283
