cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'argon/mas'

brew 'git'
brew 'curl'
brew 'jq'
brew 'mtr'
brew 'pv'
brew 'ruby-build'
brew 'rbenv'
brew 'tmux'
brew 'vim'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

cask '1password'
cask 'alfred'
cask 'caffeine'
cask 'dash'
cask 'dropbox'
cask 'evernote'
cask 'fantastical'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'omnidisksweeper'
cask 'slack'
cask 'skype'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'wireshark'

mas 'Blink Pro', id: 404360415

