cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'argon/mas'


brew 'curl'
brew 'defaultbrowser'
brew 'fzf'
brew 'git'
brew 'gnupg'
brew 'jq'
brew 'krew'
brew 'kubernetes-cli'
brew 'kustomize'
brew 'mtr'
brew 'p7zip'
brew 'pinentry-mac'
brew 'podman-desktop'
brew 'pv'
brew 'rbenv'
brew 'ripgrep'
brew 'ruby-build'
brew 'sqlite'
brew 'tmux'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'xz'
brew 'yq'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

cask '1password'
cask '1password-cli'
cask 'alacritty'
cask 'alfred'
cask 'apache-directory-studio'
cask 'aerial'
cask 'caffeine'
cask 'dash'
cask 'docker'
cask 'docker-toolbox'
cask 'dropbox'
cask 'firefox'
cask 'iterm2'
cask 'karabiner-elements'
cask 'notion'
cask 'omnidisksweeper'
cask 'omnigraffle'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'wireshark'

mas 'Blink Pro', id: 404360415

